_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_АРМСлужбыЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_АРМСлужбыЗакупок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметноНормативныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ТерриториальныеРайоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_СметныеЦеныРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_СметныеЦеныРесурсов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СметнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОптоваяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Транспортные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТранспортныеПроц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаготСкладские</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаготСкладскиеПроц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗарплМашинистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Амортизация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ремонт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаменаЗапЧастей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыТрудаМаш</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Бензин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БензинКол</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БензинЕдИзм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДизельТопливо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДизельТопливоКол</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДизельТопливоЕдИзм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СжатыйВоздух</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СжатыйВоздухКол</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СжатыйВоздухЕдИзм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СмазочныеМатериал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГидрЖидкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГидрЖидкостьКол</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГидрЖидкостьЕдИзм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перебазировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СметПрибыль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Электроэнергия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроэнергияКол</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроэнергияЕдИзм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаклРасх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияИзмененияАвтора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СметноНормативнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметноНормативныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ТерриториальныеРайоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базисная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текущая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_АРМСлужбыЗакупок/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Временно. Потом перенести в настройки.
	ОбязательныйКомментарий = Истина;
	
	ДатаДоИзменения = НачалоМесяца(Объект.Дата);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Объект.КаталогРесурсов = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиПользователяСмета",
		"НСИ_ГруппаРесурсов",
		Справочники.СМ_ГруппыРесурсов.ПустаяСсылка());
		
	Объект.СНБ = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиПользователяСмета",
		"АРМ_СметноНормативнаяБаза",
		Справочники.СМ_СметноНормативныеБазы.ПустаяСсылка(), ,"Все пользователи");
		
	Объект.Район = 	ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнойРайон",Справочники.СМ_ТерриториальныеРайоны.ПустаяСсылка(), ,ПараметрыСеанса.ТекущийПользователь.Наименование);

	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не Пользователи.РолиДоступны("СМ_АдминистраторСмета, АдминистраторСистемы, ПолныеПрава") Тогда
		Элементы.ЗаписатьНастройки.Видимость = Ложь;
		Элементы.СНБ.Доступность = Ложь;
	КонецЕсли;
	
	ЗаполнитьДеревоРесурсов();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогРесурсовПриИзменении(Элемент)
	ТаблицаРесурсов.Очистить();
	ТаблицаСкрытыхРесурсов.Очистить();
	ЗаполнитьДеревоРесурсов();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРесурсовПриИзменении(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя = "ДеревоРесурсовПометка" Тогда
		УстановитьСнятьПометки(Элемент.ТекущиеДанные.ПолучитьЭлементы(),Элемент.ТекущиеДанные.Пометка);
		УстановитьСнятьПометкиУРодителей(Элемент.ТекущиеДанные);
		
		СкрытьРесурсы(Элемент.ТекущиеДанные.ПолучитьИдентификатор());
		Если Элемент.ТекущиеДанные.Пометка Тогда
			ЗаполнитьТаблицуРесурсов(Элемент.ТекущиеДанные.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = НачалоМесяца(Объект.Дата);
	
	Если Объект.Дата <> ДатаДоИзменения Тогда
		ДатаДоИзменения = Объект.Дата;
		Если ТаблицаРесурсов.Количество() > 0 Или ТаблицаСкрытыхРесурсов.Количество() > 0 Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма);
			ПоказатьВопрос(Оповещение, НСтр("ru='Не сохраненные изменения будут потеряны. Продолжить?'"), РежимДиалогаВопрос.ДаНет);	
		Иначе
			Для Каждого ТекСтрока Из ДеревоРесурсов.ПолучитьЭлементы() Цикл
				ПеречитатьЗначенияЦенНаСервере(ТекСтрока.ПолучитьИдентификатор());
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ТаблицаРесурсов.ТолькоПросмотр = Ложь;
	Элементы.ДекорацияВнимание.Видимость = Ложь;
	Элементы.УстановитьЦену.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоискРесурса(Команда)
	
	//
	ВыполнитьОбработкуЗначенияВСтрокеПоиска();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаРесурсаПриИзменении(Элемент)
	
	//
	ВыполнитьОбработкуЗначенияВСтрокеПоиска();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаРесурсаОчистка(Элемент, СтандартнаяОбработка)
	
	//
	ВыполнитьОбработкуЗначенияВСтрокеПоиска();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоРесурсов()
	
	ДеревоРесурсов.ПолучитьЭлементы().Очистить();
	
	Если ЗначениеЗаполнено(Объект.КаталогРесурсов) Тогда
		Родитель = Справочники.СМ_Ресурсы.НайтиПоНаименованию(Объект.КаталогРесурсов.Наименование, Истина);
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда
		Родитель = Справочники.СМ_Ресурсы.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_Ресурсы.Ссылка КАК ГруппаРесурсов
	               |ИЗ
	               |	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
	               |ГДЕ
	               |	СМ_Ресурсы.Ссылка В ИЕРАРХИИ(&Родитель)
	               |	И СМ_Ресурсы.ПометкаУдаления = ЛОЖЬ
	               |	И СМ_Ресурсы.ЭтоГруппа = ИСТИНА
	               |ИТОГИ ПО
	               |	ГруппаРесурсов ИЕРАРХИЯ";	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	ВремДеревоРесурсов = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ВывестиДеревоРесурсов(ВремДеревоРесурсов, ДеревоРесурсов);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДеревоРесурсов(ВремДеревоРесурсов, Родитель);
	
	КоллекцияЭлементов = Родитель.ПолучитьЭлементы();
	Для Каждого ТекСтрока Из ВремДеревоРесурсов.Строки Цикл
		Если ТипЗнч(Родитель) <> Тип("ДанныеФормыДерево") Тогда
			Если ТекСтрока.ГруппаРесурсов = Родитель.ГруппаРесурсов Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		НоваяСтрока = КоллекцияЭлементов.Добавить();
		НоваяСтрока.ГруппаРесурсов = ТекСтрока.ГруппаРесурсов;
		ВывестиДеревоРесурсов(ТекСтрока, НоваяСтрока);
	КонецЦикла;
	
КонецПроцедуры

// Устанавливаем либо снимаем пометки у всех строк СтрокиДерева.
//
&НаКлиенте
Процедура УстановитьСнятьПометки(СтрокаДерева,Пометка)
	
	Для каждого ЭлСтроки Из СтрокаДерева Цикл
		ЭлСтроки.Пометка = Пометка;
		УстановитьСнятьПометки(ЭлСтроки.ПолучитьЭлементы(),Пометка);
	КонецЦикла;	
	
КонецПроцедуры	

// Устанавливаем либо снимаем пометки у всех родителей строки СтрокиДерева.
//
&НаКлиенте
Процедура УстановитьСнятьПометкиУРодителей(СтрокаДерева)
	
	Родитель = СтрокаДерева.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строки = Родитель.ПолучитьЭлементы();
	
	НовоеЗначение = Истина;
	
	Для каждого ЭлСтроки Из Строки Цикл
		Если (Не ЭлСтроки.Пометка) Тогда
			НовоеЗначение = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если НовоеЗначение <> Родитель.Пометка Тогда
		Родитель.Пометка = НовоеЗначение;	
	    УстановитьСнятьПометкиУРодителей(Родитель);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкрытьРесурсы(ИдентификаторСтроки)
	
	СтрокаДерева = ДеревоРесурсов.НайтиПоИдентификатору(ИдентификаторСтроки);
	Отбор = Новый Структура;
	Отбор.Вставить("ГруппаРесурсов", СтрокаДерева.ГруппаРесурсов);
	МассивСтрок = ТаблицаРесурсов.НайтиСтроки(Отбор);
	Пока МассивСтрок.Количество()>0 Цикл
		ТекСтрока = МассивСтрок[0];
		Если ТекСтрока.Цена > 0 Тогда
			ТекДанные = ТаблицаСкрытыхРесурсов.Добавить();
			ЗаполнитьЗначенияСвойств(ТекДанные, ТекСтрока);
			ТекДанные.ЕстьОтклонение = (ТекДанные.Цена <> ТекДанные.ПоследняяЦена) или (ТекДанные.ЗПМ <> ТекДанные.ПоследняяЗПМ);
		КонецЕсли;
		ТаблицаРесурсов.Удалить(ТекСтрока);
		МассивСтрок.Удалить(0);
	КонецЦикла;
	Для Каждого ПодчиненнаяСтрока Из СтрокаДерева.ПолучитьЭлементы() Цикл
		СкрытьРесурсы(ПодчиненнаяСтрока.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРесурсов(ИдентификаторСтроки)
	
	Если Не ЗначениеЗаполнено(ИдентификаторСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДерева = ДеревоРесурсов.НайтиПоИдентификатору(ИдентификаторСтроки);
	ГруппаРесурсов = СтрокаДерева.ГруппаРесурсов;
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =  "ВЫБРАТЬ
	               |	ВремТаблица.Ресурс КАК Ресурс,
	               |	ВремТаблица.Цена,
	               |	ВремТаблица.ЗПМ,
	               |	ВремТаблица.ПоследняяЦена,
	               |	ВремТаблица.ПоследняяЗПМ
	               |ПОМЕСТИТЬ ТаблицаРесурсов
	               |ИЗ
	               |	&ТаблицаСкрытыхРесурсов КАК ВремТаблица
	               |;";
	Запрос.УстановитьПараметр("ТаблицаСкрытыхРесурсов", ТаблицаСкрытыхРесурсов.Выгрузить());
	Запрос.Выполнить();
	               
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_СметныеЦеныРесурсов.Ресурс,
	               |	СМ_СметныеЦеныРесурсов.СметнаяЦена,
	               |	СМ_СметныеЦеныРесурсов.ЗарплМашинистов,
	               |	СМ_СметныеЦеныРесурсов.ИсторияИзмененияАвтора,
	               |	СМ_СметныеЦеныРесурсов.Комментарий
	               |ПОМЕСТИТЬ Цены
	               |ИЗ
	               |	РегистрСведений.СМ_СметныеЦеныРесурсов КАК СМ_СметныеЦеныРесурсов
	               |ГДЕ
	               |	СМ_СметныеЦеныРесурсов.Период = &Период
	               |	И СМ_СметныеЦеныРесурсов.Ресурс В ИЕРАРХИИ(&Родитель)
	               |	И СМ_СметныеЦеныРесурсов.СметноНормативнаяБаза = &СметноНормативнаяБаза
	               |	И СМ_СметныеЦеныРесурсов.Район = &Район
	               |	И СМ_СметныеЦеныРесурсов.ТипЦен = &ТипЦен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СМ_Ресурсы.Ссылка КАК Ресурс,
	               |	СМ_Ресурсы.ЕдиницаИзмерения,
	               |	СМ_Ресурсы.Родитель КАК ГруппаРесурсов,
	               |	ВЫБОР
	               |		КОГДА ТаблицаРесурсов.Цена ЕСТЬ NULL 
	               |			ТОГДА ЕСТЬNULL(Цены.СметнаяЦена, 0)
	               |		ИНАЧЕ ТаблицаРесурсов.Цена
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ТаблицаРесурсов.ЗПМ ЕСТЬ NULL 
	               |			ТОГДА ЕСТЬNULL(Цены.ЗарплМашинистов, 0)
	               |		ИНАЧЕ ТаблицаРесурсов.ЗПМ
	               |	КОНЕЦ КАК ЗПМ,
				   |	ВЫБОР
	               |		КОГДА ТаблицаРесурсов.Цена ЕСТЬ NULL 
	               |			ТОГДА ЕСТЬNULL(Цены.СметнаяЦена, 0)
	               |		ИНАЧЕ ТаблицаРесурсов.ПоследняяЦена
	               |	КОНЕЦ КАК ПоследняяЦена,
	               |	ВЫБОР
	               |		КОГДА ТаблицаРесурсов.ЗПМ ЕСТЬ NULL 
	               |			ТОГДА ЕСТЬNULL(Цены.ЗарплМашинистов, 0)
	               |		ИНАЧЕ ТаблицаРесурсов.ПоследняяЗПМ
	               |	КОНЕЦ КАК ПоследняяЗПМ,
	               |	СМ_Ресурсы.Код КАК Шифр,
	               |	Цены.ИсторияИзмененияАвтора КАК История,
	               |	Цены.Комментарий
	               |ИЗ
	               |	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	               |		ПО (Цены.Ресурс = СМ_Ресурсы.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРесурсов КАК ТаблицаРесурсов
	               |		ПО (ТаблицаРесурсов.Ресурс = СМ_Ресурсы.Ссылка)
	               |ГДЕ
	               |	СМ_Ресурсы.ПометкаУдаления = ЛОЖЬ
	               |	И СМ_Ресурсы.ЭтоГруппа = ЛОЖЬ
	               |	И СМ_Ресурсы.Ссылка В ИЕРАРХИИ(&Родитель)";
	
	Запрос.УстановитьПараметр("Родитель", ГруппаРесурсов);
	Запрос.УстановитьПараметр("Период", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("СметноНормативнаяБаза", Объект.СНБ);
	Запрос.УстановитьПараметр("Район", Объект.Район);
	Запрос.УстановитьПараметр("ТипЦен", Перечисления.СМ_ТипыЦен.Текущая);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекДанные = ТаблицаРесурсов.Добавить();
		ЗаполнитьЗначенияСвойств(ТекДанные, Выборка);
		ТекДанные.ЕстьОтклонение = (ТекДанные.Цена <> ТекДанные.ПоследняяЦена) или (ТекДанные.ЗПМ <> ТекДанные.ПоследняяЗПМ);
	КонецЦикла;
	
	УдалитьИзТаблицыСкрытыхРесурсовСтроки(СтрокаДерева);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьИзТаблицыСкрытыхРесурсовСтроки(СтрокаДерева)
	
	ГруппаРесурсов = СтрокаДерева.ГруппаРесурсов;
	Отбор = Новый Структура;
	Отбор.Вставить("ГруппаРесурсов", ГруппаРесурсов);
	МассивСтрок = ТаблицаСкрытыхРесурсов.НайтиСтроки(Отбор);
	Пока МассивСтрок.Количество()>0 Цикл
		ТекСтрока = МассивСтрок[0];
		ТаблицаСкрытыхРесурсов.Удалить(ТекСтрока);
		МассивСтрок.Удалить(0);
	КонецЦикла;
	
	Для Каждого ТекСтрока Из СтрокаДерева.ПолучитьЭлементы() Цикл
		УдалитьИзТаблицыСкрытыхРесурсовСтроки(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеЯчейкиЦенНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СМ_СметныеЦеныРесурсовСрезПоследних.Ресурс,
	|	СМ_СметныеЦеныРесурсовСрезПоследних.СметнаяЦена,
	|	СМ_СметныеЦеныРесурсовСрезПоследних.ЗарплМашинистов
	|ПОМЕСТИТЬ Цены
	|ИЗ
	|	РегистрСведений.СМ_СметныеЦеныРесурсов.СрезПоследних(
	|			&Период,
	|			Ресурс В ИЕРАРХИИ (&Родитель)
	|				И СметноНормативнаяБаза = &СметноНормативнаяБаза
	|				И Район = &Район
	|				И ТипЦен = &ТипЦен) КАК СМ_СметныеЦеныРесурсовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СМ_Ресурсы.Ссылка КАК Ресурс,
	|	СМ_Ресурсы.ЕдиницаИзмерения,
	|	ЕСТЬNULL(Цены.СметнаяЦена, 0) КАК Цена,
	|	ЕСТЬNULL(Цены.ЗарплМашинистов, 0) КАК ЗПМ,
	|	СМ_Ресурсы.Родитель КАК ГруппаРесурсов
	|ИЗ
	|	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	|		ПО Цены.Ресурс = СМ_Ресурсы.Ссылка
	|ГДЕ
	|	СМ_Ресурсы.Ссылка В ИЕРАРХИИ(&Родитель)
	|	И СМ_Ресурсы.ПометкаУдаления = ЛОЖЬ
	|	И СМ_Ресурсы.ЭтоГруппа = ЛОЖЬ";
	
	МассивРодителей = Новый Массив;
	ЗаполнитьМассивРодителей(ДеревоРесурсов, МассивРодителей);
	Запрос.УстановитьПараметр("Родитель", МассивРодителей);
	Запрос.УстановитьПараметр("Период", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("СметноНормативнаяБаза", Объект.СНБ);
	Запрос.УстановитьПараметр("Район", Объект.Район);
	Запрос.УстановитьПараметр("ТипЦен", Перечисления.СМ_ТипыЦен.Текущая);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Ресурс", Выборка.Ресурс);
		МассивСтрок = ТаблицаРесурсов.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда
			Для Каждого ТекСтрока Из МассивСтрок Цикл
				Если (ТекСтрока.ПоследняяЦена > 0)  Тогда
					Продолжить;
				Иначе
					ТекСтрока.Цена = Выборка.Цена;
					ТекСтрока.ЗПМ = Выборка.ЗПМ;
					ТекСтрока.ЕстьОтклонение = (ТекСтрока.Цена <> ТекСтрока.ПоследняяЦена) или (ТекСтрока.ЗПМ <> ТекСтрока.ПоследняяЗПМ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМассивРодителей(СтрокаДерева, МассивРодителей)
	
	КоллекцияСтрок = СтрокаДерева.ПолучитьЭлементы();
	Для Каждого ТекСтрока Из КоллекцияСтрок Цикл
		Если ТекСтрока.Пометка Тогда
			МассивРодителей.Добавить(ТекСтрока.ГруппаРесурсов)
		Иначе
			ЗаполнитьМассивРодителей(ТекСтрока, МассивРодителей);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПустыеЯчейкиЦен(Команда)
	ЗаполнитьПустыеЯчейкиЦенНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	
	Отбор = Новый Структура();
	Отбор.Вставить("ЕстьОтклонение", Истина);
	Масс = ТаблицаРесурсов.НайтиСтроки(Отбор);
	
	Если ОбязательныйКомментарий Тогда
		Для Каждого Эл из Масс Цикл  
			Если Не ЗначениеЗаполнено(Эл.Комментарий) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='В строке "+Эл.Шифр+" не заполнен комментарий'"));
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Ресурсы.Ресурс,
	               |	Ресурсы.Цена КАК СметнаяЦена,
	               |	Ресурсы.ЗПМ КАК ЗарплМашинистов,
	               |	Ресурсы.ПоследняяЦена КАК ПоследняяСметнаяЦена,
	               |	Ресурсы.ПоследняяЗПМ КАК ПоследняяЗарплМашинистов,
	               |	Ресурсы.Комментарий КАК Комментарий,
	               |	&СНБ КАК СметноНормативнаяБаза,
	               |	&Период КАК Период,
	               |	&Район КАК Район,
	               |	ЗНАЧЕНИЕ(Перечисление.СМ_ТипыЦен.Текущая) КАК ТипЦен
	               |ПОМЕСТИТЬ Ресурсы
	               |ИЗ
	               |	&Ресурсы КАК Ресурсы
	               |ГДЕ
	               |	Ресурсы.Цена <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Ресурсы.Ресурс,
	               |	Ресурсы.СметнаяЦена,
	               |	Ресурсы.ЗарплМашинистов,
	               |	Ресурсы.СметноНормативнаяБаза,
	               |	Ресурсы.Комментарий,
	               |	Ресурсы.Период,
	               |	Ресурсы.Район,
	               |	Ресурсы.ТипЦен
	               |ИЗ
	               |	Ресурсы КАК Ресурсы
	               |ГДЕ
	               |	(Ресурсы.ПоследняяСметнаяЦена <> Ресурсы.СметнаяЦена
	               |			ИЛИ Ресурсы.ПоследняяЗарплМашинистов <> Ресурсы.ЗарплМашинистов)";
	
	Запрос.УстановитьПараметр("Ресурсы", ТаблицаРесурсов.Выгрузить());
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("СНБ", Объект.СНБ);
	Запрос.УстановитьПараметр("Район", Объект.Район);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		НоваяЗапись = РегистрыСведений.СМ_СметныеЦеныРесурсов.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = Выборка.Период;
		НоваяЗапись.Ресурс = Выборка.Ресурс;
		НоваяЗапись.СметноНормативнаяБаза = Выборка.СметноНормативнаяБаза;
		НоваяЗапись.Район = Выборка.Район;
		НоваяЗапись.ТипЦен = Выборка.ТипЦен;
		НоваяЗапись.Прочитать();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.Записать();
		
	КонецЦикла;
	
	Для Каждого Эл из Масс Цикл  
		Эл.ПоследняяЦена = Эл.Цена;
		Эл.ПоследняяЗПМ = Эл.ЗПМ;
		Эл.ЕстьОтклонение = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"НастройкиПользователяСмета",
		"АРМ_СметноНормативнаяБаза",
		Объект.СНБ, ,"Все пользователи", Истина);
		
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиПользователяСмета",
			"ОсновнойРайон",
			Объект.Район,,ПараметрыСеанса.ТекущийПользователь.Наименование,Истина);

		
	// ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
	//	"НастройкиПользователяСмета",
	//	"АРМ_Район",
	//	Объект.Район, ,"Все пользователи", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	ЗаписатьНастройкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеПометки(Команда)
	УстановитьСнятьПометки(ДеревоРесурсов.ПолучитьЭлементы(),Ложь); 		
	Для Каждого ТекСтрока Из ДеревоРесурсов.ПолучитьЭлементы() Цикл
		СкрытьРесурсы(ТекСтрока.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеПометки(Команда)
	УстановитьСнятьПометки(ДеревоРесурсов.ПолучитьЭлементы(),Истина); 
	Для Каждого ТекСтрока Из ДеревоРесурсов.ПолучитьЭлементы() Цикл
		СкрытьРесурсы(ТекСтрока.ПолучитьИдентификатор());
	КонецЦикла;
	Для Каждого ТекСтрока Из ДеревоРесурсов.ПолучитьЭлементы() Цикл
		ЗаполнитьТаблицуРесурсов(ТекСтрока.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПеречитатьЗначенияЦенНаСервере(ИдентификаторСтроки)
	СтрокаДерева = ДеревоРесурсов.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если СтрокаДерева.Пометка Тогда
		ЗаполнитьТаблицуРесурсов(ИдентификаторСтроки);
	Иначе
		Для Каждого ТекСтрока Из СтрокаДерева.ПолучитьЭлементы() Цикл
			ПеречитатьЗначенияЦенНаСервере(ТекСтрока.ПолучитьИдентификатор());
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьЗначенияЦен(Команда)
	Если ТаблицаРесурсов.Количество() > 0 Или ТаблицаСкрытыхРесурсов.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма);
		ПоказатьВопрос(Оповещение, НСтр("ru='Не сохраненные изменения будут потеряны. Продолжить?'"), РежимДиалогаВопрос.ДаНет);	
	Иначе
		Для Каждого ТекСтрока Из ДеревоРесурсов.ПолучитьЭлементы() Цикл
			ПеречитатьЗначенияЦенНаСервере(ТекСтрока.ПолучитьИдентификатор());
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ТаблицаРесурсов.Очистить();
	ТаблицаСкрытыхРесурсов.Очистить();
	Для Каждого ТекСтрока Из ДеревоРесурсов.ПолучитьЭлементы() Цикл
		ПеречитатьЗначенияЦенНаСервере(ТекСтрока.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦену(Команда)
	
	Если Элементы.ТаблицаРесурсов.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Ошибка = Ложь;
	Если Не ЗначениеЗаполнено(Объект.СНБ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнено значение СНБ.'"));
		Ошибка = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Район) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнено значение Район.'"));
		Ошибка = Истина;
	КонецЕсли;
	Если Ошибка Тогда
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПослеВводаЦены", ЭтаФорма,Новый Структура("ВыделенныеСтроки",Элементы.ТаблицаРесурсов.ВыделенныеСтроки));
	ПоказатьВводЧисла(Оповещение, 0, "Введите цену", 15, 2);  	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЦены(Цена, ДопПараметры) Экспорт
	
	Если Цена = 0 ИЛИ Цена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ИдентификаторСтроки Из ДопПараметры.ВыделенныеСтроки Цикл
		ВыделеннаяСтрока = ТаблицаРесурсов.НайтиПоИдентификатору(ИдентификаторСтроки);
		ВыделеннаяСтрока.Цена = Цена;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработкуЗначенияВСтрокеПоиска()
	
	//
	Если ЗначениеЗаполнено(СтрокаПоискаРесурса) тогда
		Элементы.ТаблицаРесурсов.ОтборСтрок	= Новый ФиксированнаяСтруктура("Шифр", СтрокаПоискаРесурса);
	Иначе
		Элементы.ТаблицаРесурсов.ОтборСтрок	= Неопределено;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРесурсовЦенаПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаРесурсов.ТекущиеДанные;
	Если (ТекДанные <> Неопределено) Тогда
		ТекДанные.ЕстьОтклонение = (ТекДанные.Цена <> ТекДанные.ПоследняяЦена) или (ТекДанные.ЗПМ <> ТекДанные.ПоследняяЗПМ); 		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРесурсовЗПМПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаРесурсов.ТекущиеДанные;
	Если (ТекДанные <> Неопределено) Тогда
		ТекДанные.ЕстьОтклонение = (ТекДанные.Цена <> ТекДанные.ПоследняяЦена) или (ТекДанные.ЗПМ <> ТекДанные.ПоследняяЗПМ); 		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область НаУдаление

//&НаСервере 
//Функция Удалить_ВернутьДатуСеанса()
//	Возврат ТекущаяДатаСеанса();
//КонецФункции

&НаКлиенте
Процедура ИсторияЦен(Команда)
	ТекущиеДанные = Элементы.ТаблицаРесурсов.ТекущиеДанные;
	ОткрытьФорму("Обработка.СМ_АРМСлужбыЗакупок.Форма.ФормаИсторияЦен", Новый Структура("Ресурс", ТекущиеДанные.Ресурс));
КонецПроцедуры

#КонецОбласти
